In [22]:
#dependencies
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import requests
import time
from pprint import pprint
import random

In [25]:
#read csv and create DF
HOR_CSV = pd.read_csv("Homeownership_ACS.clean")
HOR_df = pd.DataFrame(HOR_CSV)

Income_Data = pd.read_csv("income_data_clean")
Income_df = pd.DataFrame(Income_Data)
Income_df.head()

   Unnamed: 0       county   2015
0           0  Autauga, AL  38591
1           1  Baldwin, AL  41412
2           2  Barbour, AL  31509
3           3     Bibb, AL  29048
4           4   Blount, AL  31987

In [26]:
# declare column names in df
HOR_df = HOR_df[["County", "HOR"]]
Income_df = Income_df[["county","2015"]]
#change column name
HOR_df  = HOR_df.rename(columns={"County": "county"})
#print head
HOR_df.head()

        county   HOR
0  Autauga, AL  73.3
1  Baldwin, AL  72.9
2  Barbour, AL  62.5
3     Bibb, AL  75.4
4   Blount, AL  78.5

In [30]:
#get sample of HOR DF
sample_home_ownership = HOR_df.sample(n=1000)
sample_home_ownership = sample_home_ownership.reset_index(drop=True)
sample_home_ownership.head()

              county   HOR
0       Richmond, NC  65.5
1   Presque Isle, MI  87.3
2  Iberia Parish, LA  67.1
3         Murray, OK  67.8
4         Arthur, NE  63.3

In [31]:
#SAMPLE OF INCOME DF
Income_Analysis = sample_home_ownership.merge(Income_df, on="county")
Income_Analysis.head()

             county   HOR    2015
0      Richmond, NC  65.5   32849
1  Presque Isle, MI  87.3   35262
2        Arthur, NE  63.3   56927
3     Henderson, KY  61.9   36644
4        Pitkin, CO  64.8  131562

In [32]:
#AMOUNT OF VALUES FOUND
len(Income_Analysis)

713